!演習問題4(5)
! 2020/06/22
! 3 元連立1次方程式の解をクラメールの公式を用いて求めるプログラム.  （Cramerの公式）

program main
      dimension A(3,3),B(3),C(3,3),H(3,3),x(3)
      integer d,e,f
      do 20 i=1,3
       do 10 j=1,3
        write(6,*) 'A(',i,j,')='
         read(5,*) A(i,j)
   10 continue
        write(6,*) 'b(',I,')='
        read(5,*) B(i)
        x(i)=0
   20 continue
   
    !行列 A
        write(*,*) '       x1               x2               x3                b'
		do i=1,3
        write(*,*) (a(i,j),j=1,3),'=',b(i)
        end do
	
!     行列式の計算
      detA1=A(1,1)*A(2,2)*A(3,3)    ! detA1~detA6の成分は サラスの方法 を用いる.
      detA2=A(1,3)*A(2,1)*A(3,2)
      detA3=A(1,2)*A(2,3)*A(3,1)
      detA4=A(1,1)*A(2,3)*A(3,2)
      detA5=A(1,2)*A(2,1)*A(3,3)
      detA6=A(1,3)*A(2,2)*A(3,1)
	  detA=detA1+detA2+detA3-detA4-detA5-detA6
	  
       H(1,1) = (A(2,2)*A(3,3) - A(2,3)*A(3,2))
       H(2,1) = (-1)*(A(2,1)*A(3,3) - A(2,3)*A(3,1))
       H(3,1) = (A(2,1)*A(3,2) - A(2,2)*A(3,1))
	   
       H(1,2) = (-1)*(A(1,2)*A(3,3) - A(1,3)*A(3,2))
       H(2,2) = (A(1,1)*A(3,3) - A(1,3)*A(3,1))
       H(3,2) = (-1)*(A(1,1)*A(3,2) - A(1,2)*A(3,1))
	   
       H(1,3) = (A(1,2)*A(2,3) - A(1,3)*A(2,2))
       H(2,3) = (-1)*(A(1,1)*A(2,3) - A(1,3)*A(2,1))
       H(3,3) = (A(1,1)*A(2,2) - A(1,2)*A(2,1))
	   
      do 40 d=1,3
        do 40 e=1,3
        C(d,e)=H(d,e)/detA
        x(d)=x(d)+C(d,e)*B(e)
   40 continue
   
   ! 行列Aの行列式
	  write (6,*) 'Determinant of matrix A'
      write(6,*) detA
    
   ! 解 x1,x2,x3
     write (6,*) 'Solutions x1,x2,x3'
	 do  f=1,3
      write(6,*) 'x(',f,')=',x(f)
      end do
	  
      end program main

!░█▀▀▀ ░█▀▀▀█ ░█▀▀█ ▀▀█▀▀ ░█▀▀█ ─█▀▀█ ░█▄─░█ ▄▀▀▄ █▀▀█ 
!░█▀▀▀ ░█──░█ ░█▄▄▀ ─░█── ░█▄▄▀ ░█▄▄█ ░█░█░█ ▀▄▄█ █▄▀█ 
!░█─── ░█▄▄▄█ ░█─░█ ─░█── ░█─░█ ░█─░█ ░█──▀█ ─▄▄▀ █▄▄█