! 演習問題5(1)
!   例題11 を参考にして，２つの３×３行列の和と積を求めるサブルーチンを作成し，次の行列A,B を
!   用いてサブルーチンプログラムの信頼性を確認せよ.
!    ensyu5-1

program main
real :: a(3,3) ,b(3,3),w(3,3)
do i=1,3
do j=1,3
write(6,*) 'A(',i,j,')=','B(',i,j,')='
read(5,*) a(i,j),b(i,j)

call wwa()
do i=1,3
do j=1,3
write (w(i,j),j=1,3)


end program main

! ---------------------------------------------------
subroutine wwa()

do i=1,3
 do j=1,3
 w(i,j) = a(i,j) + b(i,j)  
  end do     
write(6,10) (w(i,j),j=1,3) 
	end do  
end do
10 format(1x,3(2x,f5.2))

end subroutine wwa

! ----------------------------------------------------

!░█▀▀▀ ░█▀▀▀█ ░█▀▀█ ▀▀█▀▀ ░█▀▀█ ─█▀▀█ ░█▄─░█ ▄▀▀▄ █▀▀█ 
!░█▀▀▀ ░█──░█ ░█▄▄▀ ─░█── ░█▄▄▀ ░█▄▄█ ░█░█░█ ▀▄▄█ █▄▀█ 
!░█─── ░█▄▄▄█ ░█─░█ ─░█── ░█─░█ ░█─░█ ░█──▀█ ─▄▄▀ █▄▄█
